import { LazyLoadImage } from "react-lazy-load-image-component";
import 'react-lazy-load-image-component/src/effects/blur.css';

const BehindTheStory = () => {
    return (
        <div className="mt-20 flex flex-col items-center">
            <h1 className="text-2xl font-bold text-[#d5a538]">Behind The Story</h1>
            <LazyLoadImage

                className="w-[400px]" src="https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiZ5Xt1q6xJNbXgrU7YPfYL9cS1MTGb5qdtBaEjoNrYiU6r_ZuDQtmpftPbS2-nHyB4yJk3fhIeJSmNsCcWDWRfeXNl8vUD28yM4RKXcOu1OW_8a8lBKh_d2Qca_U6T4KfwVpQwCJkEFuPiBbEYf1eKelX-Bs_y-efLmYWtdRzbXCnZdTtUe19QLV5CplY/s1600/ptk.webp" alt=""
                effect="blur"
                wrapperProps={{
                    style: { transitionDelay: "1s" },
                }}
            />
            <p style={{ fontFamily: 'Mina' }} className="p-10 bg-[#00000090] text-[#d5a538]">
                ফুটবল । সারা দুনিয়ার মানুষের কাছে একটি আবেগের নাম । এ খেলার আসল শুরু কবে তা অজানা হলেও আমেরিকান ফুটবলের সুচনা ১৮৬৯ সালে । সেই থেকে পুরো বিশ্বের কতো কোটি মানুষের প্রিয় খেলা যে এই ফুটবল তার হিসাব করা মুশকিল । এই পুরো দুনিয়ার বাংলাদেশ নামক একটি রাষ্ট্রে ক্যান্টনমেন্ট নামক এক জায়গায় বিএএফ ঘাঁটির বিএএফ শাহীন কলেজ কুর্মিটোলা সংলগ্ন বেইজ মাঠে সুচনা হয় এফ সি প্রিডেটিরস এর । শুরুতে অল্প কতকজন মিলে খেলা হতো । তারপর ধীরে ধীরে বাড়তে থাকে প্লেয়ারের সংখ্যা । মাঝে এমন একটা পরিস্থিতি হয়েছিলো, ফুটসলের ফিল্ডেই ৩০+ প্লেয়ার নিয়ে খেলা হতো । তবে ধীরে ধীরে সেটা কমে আসে । প্রতিদিন এরকমটা হতো না । কেবল ছুটির দিনগুলোতে এরকমটা হতো । এভাবে প্রায় দেড় বছরেরও বেশি সময় ধরে এই ক্লাবের সাথে কেটেছে আমার সময় । আমি খেলতে পারতাম না, গোল কিপার রাখতো । কয়েকজন আমাকে উপরে উঠাতো খেলার জন্য, ওইটুকুই আমার খেলা । গোলকিপার থাকতে ভয় পেতাম আমি । আমার একটা বাজে স্বভাব গিল্ট ফিল হওয়া । একটা গোল খেলেই গিল্ট ফিল হতো । মনে হয় পুরো দোষটাই আমার! যাই হোক, এখন গিল্ট ফিল বেশি নেই । এছাড়াও আমার আরেকটা কাজ ছিলো । বল নিয়ে যাওয়া, নিয়ে আসা । ব্যাগের ভেতর বল ভরে কাধে নিয়ে খেলতে যেতাম । মজার ব্যাপার, আমার ব্যাগে বল নিয়ে যাওয়া দেখে আন্টিরা মনে করতো আমি প্রাইভেট পড়তে যাচ্ছি । আমার আম্মুকে এসে বলতো “বাহ, বিকেলে সবাই যেখানে খেলতে যায়, আপনার ছেলে কি সুন্দর পড়তে যায়, প্রত্যেকটা দিন!” তবে একটা জিনিস, আমি যে খেলার জন্যই যেতাম তা না । আমি যেতাম সবার সাথে দেখা করতে । খেলা তো দেখার করার উপকরন মাত্র । এখন আমার খেলা আর হয় না । ওরা খেলে, তবে আগের মতো রেগুলার না । প্লেয়ার কেমন হয় তা আমার অজানা, তবে একটা করুণ সত্য এমন একটা দিন আসবে, যেদিন কেউই আর খেলতে যাবে না । এফসি প্রিডেটরস থেকে যাবে মনের এক স্মৃতির পাতায় । কিন্তু কথা হচ্ছে, মনে থাকা স্মৃতিগুলো দিনের পর দিন কেমন যেনো অস্পষ্ট হয়ে যায় । তাই তো স্পষ্ট কিছু স্মৃতি ধারণ করে রাখার জন্য আমার এই ক্ষুদ্র প্রয়াস । কতোটুকু সফল জানিনা, কিংবা এই স্মৃতি কতোজন হাতড়ে দেখবে তা জানিনা, কিন্তু আমি অবশ্যই দেখবো । আমার জীবনের অনেক অনেক মুল্যবান সময়গুলোর এই একটাকে আমি অস্পষ্ট হয়ে যেতে দেবো না । আমি আমার বন্ধুদের সবাইকে ভালোবাসি এবং প্রতিনিয়ত মিস করি ।
            </p>
        </div>
    );
};

export default BehindTheStory;